githup98/stm32ProgramBasedRegister/usbStm32f411vet6Register/Core/Src/newUsb.c
#include "newUsb.h"
#include "stm32f4xx_hal.h"

uint32_t *pOTG_FS_GINTMSK = (uint32_t*)(OTG_FS_BASE_ADDR + 0x018);
uint32_t *pOTG_FS_GINTSTS = (uint32_t*)(OTG_FS_BASE_ADDR + 0x014);
uint32_t *pOTG_FS_GRSTCTL = (uint32_t*)(OTG_FS_BASE_ADDR + 0x010);
uint32_t *pOTG_FS_GRXSTSR = (uint32_t*)(OTG_FS_BASE_ADDR + 0x01C);
uint32_t *pOTG_FS_GRXSTSP = (uint32_t*)(OTG_FS_BASE_ADDR + 0x020);
uint32_t *pOTG_FS_GUSBCFG = (uint32_t*)(OTG_FS_BASE_ADDR + 0x00C);
uint32_t *pOTG_FS_GAHBCFG = (uint32_t*)(OTG_FS_BASE_ADDR + 0x008);

uint32_t *pOTG_FS_DAINT = (uint32_t*)(OTG_FS_BASE_ADDR + 0x818);
uint32_t *pOTG_FS_DCTL = (uint32_t*)(OTG_FS_BASE_ADDR + 0x804);
uint32_t *pOTG_FS_DSTS = (uint32_t*)(OTG_FS_BASE_ADDR + 0x808);
uint32_t *pOTG_FS_DCFG = (uint32_t*)(OTG_FS_BASE_ADDR + 0x800);
uint32_t *pOTG_FS_GCCFG = (uint32_t*)(OTG_FS_BASE_ADDR + 0x038);
uint32_t *pOTG_FS_PCGCCTL = (uint32_t*)(OTG_FS_BASE_ADDR + 0xE00);
uint32_t *pOTG_FS_DIEPMSK = (uint32_t*)(OTG_FS_BASE_ADDR + 0x810);
uint32_t *pOTG_FS_DOEPMSK = (uint32_t*)(OTG_FS_BASE_ADDR + 0x814);
uint32_t *pOTG_FS_DAINTMSK = (uint32_t*)(OTG_FS_BASE_ADDR + 0x81C);

uint32_t *pOTG_FS_DIEPEMPMSK = (uint32_t*)(OTG_FS_BASE_ADDR + 0x834);

uint32_t *pOTG_FS_GRXFSIZ = (uint32_t*)(OTG_FS_BASE_ADDR + 0x024);
uint32_t *pOTG_FS_HNPTXFSIZ__DIEPTXF0 = (uint32_t*)(OTG_FS_BASE_ADDR + 0x028);
uint32_t *pOTG_FS_DIEPTXFx = (uint32_t*)(OTG_FS_BASE_ADDR + 0x104 + 0x04);

uint32_t *pOTG_FS_DIEPINTx = (uint32_t*)(OTG_FS_BASE_ADDR + 0x908 + 0x20*0);
uint32_t *pOTG_FS_DOEPINTx = (uint32_t*)(OTG_FS_BASE_ADDR + 0xB08 + 0x20*0);
uint32_t *pOTG_FS_DOEPCTLx = (uint32_t*)(OTG_FS_BASE_ADDR + 0xB00);
uint32_t *pOTG_FS_DIEPCTLx = (uint32_t*)(OTG_FS_BASE_ADDR + 0x900);
uint32_t *pOTG_FS_DOEPTSIZ0 = (uint32_t*)(OTG_FS_BASE_ADDR + 0xB10);
uint32_t *pOTG_FS_DIEPTSIZ0 = (uint32_t*)(OTG_FS_BASE_ADDR + 0x910 + 0x20 * 0);

uint32_t *pOTG_FS_DTXFSTS = (uint32_t*)(OTG_FS_BASE_ADDR + 0x918 + 0x20 * 0);





//create struct with packed and aligned 1 for write to fifo

#ifndef __PACKED_STRUCT
#define __PACKED_STRUCT  struct __attribute__((packed, aligned(1)))
#endif

#ifndef __UNALIGNED_32_READ_DATA  //Read mean that fifo will read data into fifo == write data to fifo
#pragma GCC diagnostic push
#pragma GCC diagnostic ignored "-Wpacked"
//#pragma GCC diagnostic ignored "-Wattributes"
__PACKED_STRUCT T_UINT32_READ_DATA{uint32_t v;};
#pragma GCC diagnostic pop
#define __UNALIGNED_32_READ_DATA(addr)  (((const struct T_UINT32_READ_DATA*)(const void*)addr)->v)
#endif

uint8_t DeviceDescriptor[18] __attribute__((aligned(4))) =
{
	0x12, //length = 18 bytes
	0x01, //bDescriptorType = device
	0x00, //bcdUSB = usb 2.0, due to LBS first -> 0x00 -> 0x02
	0x02,
	0x02, //bDeviceClass = CDC (0x02), or 0x00 (defined later in interface desc)
	0x02, //bDeviceSubClass don't care
	0x00, //bDeviceProtocolClass don't care
	0x40, //bMaxPAcketSize0 , why previous is 0x08
	0x83, //idVendor 0x483 (1155 in Dec)
	0x04,
	0x40, //idVendor 0x5740 (22336 in Dec), why previous uis 22288 ?
	0x57,
	0x00, //bcdDevice 1.0
	0x01,
	0x00, //three strings are no need,  iManufacturer
	0x00, //iProduct
	0x00, //iSerialNumber
	0x01, //bNumConfigurations

};





//configuration for USB_FS, cpy from: ../../testUSB\ simple/Middlewares/ST/STM32_USB_Device_Library/Class/CDC/Src/usbd_cdc.c

#if USB_CDC_CONFIG_DESC_SIZ // //ttemp is nott used
__ALIGN_BEGIN static uint8_t USBD_CDC_CfgDesc[USB_CDC_CONFIG_DESC_SIZ] __ALIGN_END =
{
  /* Configuration Descriptor */
  0x09,                                       /* bLength: Configuration Descriptor size */
  USB_DESC_TYPE_CONFIGURATION,                /* bDescriptorType: Configuration */
  USB_CDC_CONFIG_DESC_SIZ,                    /* wTotalLength */
  0x00,
  0x02,                                       /* bNumInterfaces: 2 interfaces */
  0x01,                                       /* bConfigurationValue: Configuration value */
  0x00,                                       /* iConfiguration: Index of string descriptor
                                                 describing the configuration */
#if (USBD_SELF_POWERED == 1U)
  0xC0,                                       /* bmAttributes: Bus Powered according to user configuration */
#else
  0x80,                                       /* bmAttributes: Bus Powered according to user configuration */
#endif /* USBD_SELF_POWERED */
  USBD_MAX_POWER,                             /* MaxPower (mA) */

  /*---------------------------------------------------------------------------*/

  /* Interface Descriptor */
  0x09,                                       /* bLength: Interface Descriptor size */
  USB_DESC_TYPE_INTERFACE,                    /* bDescriptorType: Interface */
  /* Interface descriptor type */
  0x00,                                       /* bInterfaceNumber: Number of Interface */
  0x00,                                       /* bAlternateSetting: Alternate setting */
  0x01,                                       /* bNumEndpoints: One endpoint used */
  0x02,                                       /* bInterfaceClass: Communication Interface Class */
  0x02,                                       /* bInterfaceSubClass: Abstract Control Model */
  0x01,                                       /* bInterfaceProtocol: Common AT commands */
  0x00,                                       /* iInterface */

  /* Header Functional Descriptor */
  0x05,                                       /* bLength: Endpoint Descriptor size */
  0x24,                                       /* bDescriptorType: CS_INTERFACE */
  0x00,                                       /* bDescriptorSubtype: Header Func Desc */
  0x10,                                       /* bcdCDC: spec release number */
  0x01,

  /* Call Management Functional Descriptor */
  0x05,                                       /* bFunctionLength */
  0x24,                                       /* bDescriptorType: CS_INTERFACE */
  0x01,                                       /* bDescriptorSubtype: Call Management Func Desc */
  0x00,                                       /* bmCapabilities: D0+D1 */
  0x01,                                       /* bDataInterface */

  /* ACM Functional Descriptor */
  0x04,                                       /* bFunctionLength */
  0x24,                                       /* bDescriptorType: CS_INTERFACE */
  0x02,                                       /* bDescriptorSubtype: Abstract Control Management desc */
  0x02,                                       /* bmCapabilities */

  /* Union Functional Descriptor */
  0x05,                                       /* bFunctionLength */
  0x24,                                       /* bDescriptorType: CS_INTERFACE */
  0x06,                                       /* bDescriptorSubtype: Union func desc */
  0x00,                                       /* bMasterInterface: Communication class interface */
  0x01,                                       /* bSlaveInterface0: Data Class Interface */

  /* Endpoint 2 Descriptor */
  0x07,                                       /* bLength: Endpoint Descriptor size */
  USB_DESC_TYPE_ENDPOINT,                     /* bDescriptorType: Endpoint */
  CDC_CMD_EP,                                 /* bEndpointAddress */
  0x03,                                       /* bmAttributes: Interrupt */
  LOBYTE(CDC_CMD_PACKET_SIZE),                /* wMaxPacketSize */
  HIBYTE(CDC_CMD_PACKET_SIZE),
  CDC_FS_BINTERVAL,                           /* bInterval */
  /*---------------------------------------------------------------------------*/

