githup98/stm32ProgramBasedRegister/usbStm32f411vet6Register/Core/Src/newUsb.c
}


void startDev(void)
{
	//enable global interrupt
	*pOTG_FS_GAHBCFG |= (1 << GINTMSK_);

	//ensure clock gating is open
	*pOTG_FS_PCGCCTL &= ~((1 << STPPCLK) | (1 << GATEHCLK));

	//start connecting
	*pOTG_FS_DCTL &= ~(1 << SDIS);

}





uint32_t usbReceivedData[12] = {0};
void USB_ReadPacket(void)
{
	//read 8 byte, it is request device description package from host
	for(int i = 0; i < 2; i++)
	{
		usbReceivedData[i] = *(uint32_t*)(OTG_FS_BASE_ADDR + OTG_FIFO_BASE);
	}

}

extern uint8_t DeviceDescriptor[18];
void *getFSDeviceDescriptor(uint8_t *lenDes)
{
	*lenDes = sizeof(DeviceDescriptor);
	return (void*)DeviceDescriptor;
}

void *getFsConfigurationDesc(uint8_t *lenDes)
{
	*lenDes = sizeof(USBD_CDC_CfgDesc);
	return (void*)USBD_CDC_CfgDesc;
}

uint8_t usbSendData(uint32_t* pSetup, uint8_t len)
{
	uint16_t lenRequired = (pSetup[1] >> 16) & 0xffff;
	if(epStt.In == 1)
	{

		if(len == 0)
		{
			*pOTG_FS_DIEPTSIZ0 &= ~(0x3FF << PKTCNT);
			*pOTG_FS_DIEPTSIZ0 &= ~(0x7FFFF << XFRSIZ);

			*pOTG_FS_DIEPTSIZ0 |= ((0x3FF << PKTCNT) & (1 << PKTCNT));
		}
		if(len > lenRequired)
		{
			len = lenRequired;
		}
		if(len != 0)
		{


			*pOTG_FS_DIEPTSIZ0 &= ~(0x3FF << PKTCNT);
			*pOTG_FS_DIEPTSIZ0 &= ~(0x7FFFF << XFRSIZ);

			*pOTG_FS_DIEPTSIZ0 |= ((0x3FF << PKTCNT) & (1 << PKTCNT));

			*pOTG_FS_DIEPTSIZ0 |= (len << XFRSIZ);
		}


		//enable EP (start transmit)
		*pOTG_FS_DIEPCTLx |= ((1 << CNAK) | (1 << EPENA)); //respond DATA is send  (show packet in wireshark)

		//enable Tx empty fifo interrupt
		if(len > 0)
		{
			//for enum 0
			*pOTG_FS_DIEPEMPMSK |= (1 << 0);
		}
	}
	else
	{
		if(len > lenRequired)
		{
			len = lenRequired;
		}
		//if(lenRequired != 0)
		//{
			*pOTG_FS_DOEPTSIZ0 &= ~(0x3FF << PKTCNT);
			*pOTG_FS_DOEPTSIZ0 &= ~(0x7FFFF << XFRSIZ);

			*pOTG_FS_DOEPTSIZ0 |= ((0x3FF << PKTCNT) & (1 << PKTCNT));

			*pOTG_FS_DOEPTSIZ0 |= (len << XFRSIZ);

			//enable EP (start transmit)
			*pOTG_FS_DOEPCTLx |= ((1 << CNAK) | (1 << EPENA));

		//}
	}

	return 0;
}


void setAddressEp(uint32_t *setupPacket)
{
	uint32_t address = (uint32_t)(setupPacket[0] >> 16);
	if(((setupPacket[1] >> 16) == 0) && ((setupPacket[1] & 0xffff) == 0) && (address < 128))
	{
		*pOTG_FS_DCFG &= ~(0x7f << DAD);
		*pOTG_FS_DCFG |= (address << DAD);
	}

}


uint8_t min(uint8_t len1, uint16_t len2)
{
	return (uint8_t)(len1 < len2 ? len1 : len2);
}


uint8_t checkProblem = 0;

void stdDev(uint32_t *pSetup)
{
	uint8_t bRequest = (pSetup[0] >> 8) & 0xff;
	uint8_t lenDesc = 0;
	uint16_t lenFromSetupCommand = (pSetup[1] >> 16);


	switch (bRequest)
	{
	case 5:
		setAddressEp(pSetup);
		epStt.In = 1;
		usbSendData(NULL, 0);
		break;
	case 6:
		switch(pSetup[0] >> 24)
		{
			case 0x01: //get device descriptor
				epStt.In = 1;

				//////
				Descriptor = getFSDeviceDescriptor(&lenDesc);
				remainLengthEp0 = min(lenDesc, lenFromSetupCommand);
				totalLengthEp0 = remainLengthEp0;

				//////
				usbSendData(pSetup, remainLengthEp0);
				break;
			case 0x02: //get config
				epStt.In = 1;
				//usbSendData(NULL, NULL, 0);
				//we must create function to change maxpacketsize between HS and FS, check HAL code
				//but now we can skip it due to value default in config des is for FS

				//attention due to size of config desc is larger 64 byte
				
				Descriptor = getFsConfigurationDesc(&lenDesc);
				remainLengthEp0 = min(lenDesc, lenFromSetupCommand);
				totalLengthEp0 = remainLengthEp0;
				

				usbSendData(pSetup, remainLengthEp0);
				
				break;
			case 0x06: //get device_qualifer (for device support both HS and FS speed)
				if(((*pOTG_FS_DSTS >> ENUMSPD) & 0x03) == 0x00) //High speed
				{
					//do some things
				}
				else if(((*pOTG_FS_DSTS >> ENUMSPD) & 0x03) == 0x03) //full speed
				{
					epStt.In = 1;
					usbSendData(NULL, 0); //no send data to avoid waiting from host.
				}
				break;
			default:
				break;
		}

		break;
	default:
		break;
	}
}

void extractSetupPacket(uint32_t *pSetup)
{
	uint8_t bmRequestType = pSetup[0] & 0xff;
	//if(bmRequestType == 0x80)//get phase transfer direction
	//{
		switch ((bmRequestType >> 5) & 0x03) //get Type
		{
		case 0:
			switch(bmRequestType & 0x1f)     //get Recepient
			{
			case 0:
				stdDev(pSetup);
				break;
			default:
				break;
			}
			break;
		default:
			break;

		}
	//}
	//else
	//{
		////temptly do nothing
	//}
}



void writePacket(uint8_t *dataSrc, uint8_t len)
{
	uint8_t count32 = (len + 3) / 4 ; //+3 'cause of len = 5, 9... bytes
	uint8_t *pSrc = dataSrc;
	for(int i = 0; i < count32; i++)
	{
		*(uint32_t*)(OTG_FS_BASE_ADDR + OTG_FIFO_BASE) = __UNALIGNED_32_READ_DATA(pSrc);
		pSrc++;
		pSrc++;
		pSrc++;
		pSrc++;
	}
}


uint8_t indexCheckOderRun = 0;
void writeEmpFifo(uint8_t *data, uint8_t len)
{
	uint8_t lenLocal = 0;
	uint8_t len32 = 0;
	uint8_t count = 0;
	
	lenLocal = len - count;

	if(lenLocal > 64)
	{
		lenLocal = 64; //64 is max packet size, this value should be read from register, this line is aim for testing
	}

	len32 = (lenLocal + 3) / 4U;
	//check available space in fifo (unit in word)
	while((*pOTG_FS_DTXFSTS >= len32) && (len != 0U) && (count < len)) //this line must be modify later
	{
		lenLocal = len - count;
		if(lenLocal > 64)
		{
			lenLocal = 64;
		}

		len32 = (len + 3) / 4U;
		writePacket(data, lenLocal); //no data respone to host (checked by wireshark) due to ep have already enabled

		data += lenLocal;
		count += lenLocal;
	}


	// remove tx empty fifo intererrupt flag for end point 0

	if(len <= count)
	{
		*pOTG_FS_DIEPEMPMSK &= ~(1 << 0);
	}

}


void usbEpSetStall(uint8_t epNum)
{
	if(epStt.In == 1)
	{
		if((((*pOTG_FS_DIEPCTLx >> 31) & 0x01) == 0) && (epNum != 0)) //need to modify for all CTL register
		{
			*pOTG_FS_DIEPCTLx |= ~(1 << 30); //this line will clear EPDIS bit (rs bit), mean EPDIS interrupt will be trigger
		}
		*pOTG_FS_DIEPCTLx |= (1 << STALL);
	}
	else
	{
		if((((*pOTG_FS_DOEPCTLx >> 31) & 0x01) == 0) && (epNum != 0)) //need to modify for all CTL register
		{
			*pOTG_FS_DOEPCTLx |= ~(1 << 30); //this line will clear EPDIS bit (rs bit), mean EPDIS interrupt will be trigger
		}
		*pOTG_FS_DOEPCTLx |= (1 << STALL);
	}
}



