githup98/stm32ProgramBasedRegister/usbStm32f411vet6Register/Core/Src/newUsb.c
void ep0OutStart(void)
{
	//need modify for all DOEPTSIZ register
	
	//if(USB_OTG_CORE_ID_300A)
	//{
	//
	//}


	*pOTG_FS_DOEPTSIZ0 = 0U;
	*pOTG_FS_DOEPTSIZ0 |= (1 << PKTCNT);
	*pOTG_FS_DOEPTSIZ0 |= (3 * 8);
	*pOTG_FS_DOEPTSIZ0 |= (3 << STUPCNT);
	
	//if(dma == 1)
	//{
	//
	//}
}


void stallEP(uint8_t epAddress)
{
	if((epAddress & 0x80) == 0x80)
	{
		epStt.In = 1;
		//epNum =
	}
	else
	{
		epStt.Out = 1;
		//epNum = 
	}
	epStt.Stall = 1;

	usbEpSetStall(epAddress & 0x0f);

	if((epAddress & 0x0f) == 0)
	{
		ep0OutStart(); //reset DOEPTSIZ register
	}
}


//void prepairReceive()
//{
//
//}


uint8_t timeWrite = 0;

void receivedStatus(void)
{
	epStt.In = 0;	
	usbSendData(NULL, 0);  //<==> EP0StartXfer in HAL library

}

void dataInStageCallback(uint32_t *pSetup)
{
	
	if(1)//if enum == 0, change if condition for overall
	{
		if(1) //check status: USBD_EP0_DATA_IN, please complete the code for the overview
		{
			if(remainLengthEp0 > maxPacketSizeEp0)
			{
				remainLengthEp0 -= maxPacketSizeEp0;
				usbSendData(pSetup, remainLengthEp0);
				receivedStatus();
			}
			else
			{
				stallEP(0x80);
				receivedStatus();
			}
		}
	}
}



void epOutComplete(uint8_t eNum)
{
	//if(dma == 1)
	//{
	//
	//}
	
	ep0OutStart();

	//dataOutStage() // in setup phase this function can be ignored
}



void suspendCallback(void)
{
	//if(lowPowerEnable)
	//{
	//
	//}
	*pOTG_FS_PCGCCTL |= (1 << STPPCLK); //stop PHY clock source
	*pOTG_FS_GINTSTS |= (1 << USBSUSP); //clear usususp interrupt flag 
}


void resetUSBSignal(void)
{
	//disable remote wakeup signal
	*pOTG_FS_DCTL &= ~(1 << RWUSIG);

	//init 4 end point (f411 has 4 end point)
	for(int i = 0; i < 4; i++)
	{
		//clear status of interrupt
		*(uint32_t*)(pOTG_FS_DIEPINTx + 0x20 * i) = 0xFB7F;
		*(uint32_t*)(pOTG_FS_DOEPINTx + 0x20 * i) = 0xFB7F;

		//clear STALL signal
		*(uint32_t*)(pOTG_FS_DIEPCTLx + 0x20 * i) &= ~(1 << STALL);
		*(uint32_t*)(pOTG_FS_DOEPCTLx + 0x20 * i) &= ~(1 << STALL);

		//enable SNAK for OUT end point
		*(uint32_t*)(pOTG_FS_DOEPCTLx + 0x20 * i) |= (1 << SNAK);
	}

	//enable interrupt for end point IN 0//OUT 0
	*pOTG_FS_DAINTMSK |= ((1 << INEPM0) | (1 << OUTEPM0));

	//set interrupt when using endpoint 1 (this is skipped temporary)
	*pOTG_FS_DIEPMSK |= ((1 << TOM) | (1 << XFRCM) | (1 << EPDM));
	*pOTG_FS_DOEPMSK |= ((1 << NAKM) | (1 << STSPHSRXM) | (1 << STUPM) \
	| (1 << XFRCM) | (1 << EPDM));
	
	//set address (address = 0)
	*pOTG_FS_DCFG &= ~(1 << DAD);	

	//setup EP0 for first time receive setup packet
	ep0OutStart();

}


void usbActiveSetup(void)
{
	//set maxpacket size
	*pOTG_FS_DIEPCTLx &= ~(1 << MPSIZ__OTG_FS_DIEPCTLx); //00 mean maxpacket size ==  64 bytes (maximum)

	//clear global IN NAK CGINAK bit in DCTL (w bit)
	*pOTG_FS_DCTL |= (1 << CGINAK);

}

uint8_t usbGetSpeed(void)
{
	uint8_t speed;
	if(((*pOTG_FS_DSTS >> 1) & 0x03) == 3) //OTG_FS
	{
		speed = 2; 
	}
	else if(((*pOTG_FS_DSTS >> 1) & 0x03) == 0) //OTG_HS
	{
		speed  = 0;
	}
	else
	{
		speed = 0x0f;
	}
	
	return speed;

}

void usbSetTRDTValue(uint8_t hclk, uint8_t speed)
{
	uint8_t usbTrd;
	if(speed == 2) //OTG_FS
	{
		if ((hclk >= 14200000U) && (hclk < 15000000U))
		{
		  /* hclk Clock Range between 14.2-15 MHz */
		  usbTrd = 0xFU;
		}
		else if ((hclk >= 15000000U) && (hclk < 16000000U))
		{
		  /* hclk Clock Range between 15-16 MHz */
		  usbTrd = 0xEU;
		}
		else if ((hclk >= 16000000U) && (hclk < 17200000U))
		{
		  /* hclk Clock Range between 16-17.2 MHz */
		  usbTrd = 0xDU;
		}
		else if ((hclk >= 17200000U) && (hclk < 18500000U))
		{
			//hclk Clock Range between 17.2-18.5 MHz
			usbTrd = 0xCU;
		}
		else if ((hclk >= 18500000U) && (hclk < 20000000U))
		{
		  /* hclk Clock Range between 18.5-20 MHz */
		  usbTrd = 0xBU;
		}
		else if ((hclk >= 20000000U) && (hclk < 21800000U))
		{
			//hclk Clock Range between 20-21.8 MHz
			usbTrd = 0xAU;
		}
		else if ((hclk >= 21800000U) && (hclk < 24000000U))
		{
		  /* hclk Clock Range between 21.8-24 MHz */
		  usbTrd = 0x9U;
		}
		else if ((hclk >= 24000000U) && (hclk < 27700000U))
		{
		  /* hclk Clock Range between 24-27.7 MHz */
		  usbTrd = 0x8U;
		}
		else if ((hclk >= 27700000U) && (hclk < 32000000U))
		{
		  /* hclk Clock Range between 27.7-32 MHz */
		  usbTrd = 0x7U;
		}
		else /* if(hclk >= 32000000) */
		{
		  /* hclk Clock Range between 32-200 MHz */
		  usbTrd = 0x6U;
		}	
	}
	else if(speed == 0) //OTG_FS
	{
		usbTrd = 9;
	}
	else  //default case
	{
		usbTrd = 9;
	}

	//clear value
	*pOTG_FS_GUSBCFG &= ~(0x0f << TRDT);  //4 bit 10 -> 13
	*pOTG_FS_GUSBCFG |= (usbTrd << TRDT);

}

//void enumSetSpeed(void)
//{
//
//}


void usbdActivateEndpoint(uint8_t epNum, uint8_t epType, uint8_t epMaxPacketSize)
{
	if(epStt.In == 1)
	{
		//unmask interrupt for partical end point
		*pOTG_FS_DAINTMSK |= ((0xffff << 0) & (1 << epNum)); //equivalant 2 command: clear previous value, assign new value
		if((*pOTG_FS_DIEPCTLx >> EPENA) == 0x01) //due to EPENA is 31th bit -> no need to & 0x01
		{
			*pOTG_FS_DIEPCTLx |= ((epMaxPacketSize << MPSIZ__OTG_FS_DIEPCTL0) | (epType << 18) | (epNum << 22)\
			| (1 << SD0PID_SEVNFRM) | (1 << USBAEP));
		}
	}	
	else
	{
		//unmask interrupt for partical end point
		*pOTG_FS_DAINTMSK |= ((0xffff << 16) & ((1 << epNum) << 16)); //equivalant 2 command: clear previous value, assign new value
		if((*pOTG_FS_DOEPCTLx >> EPENA) == 0x01) //due to EPENA is 31th bit -> no need to & 0x01
		{
			*pOTG_FS_DOEPCTLx |= ((epMaxPacketSize << MPSIZ__OTG_FS_DIEPCTL0) | (epType << 18) | (epNum << 22)\
			| (1 << SD0PID_SEVNFRM) | (1 << USBAEP));
		}
	}
}

void openEp(uint8_t epAddress, uint8_t epType, uint8_t epMaxPacketSize)
{
	if((epAddress & 0x80) == 0x80)
	{
		epStt.In = 1;
	}
	else
	{
		epStt.In = 0;
	}
	
	// temp no need
	//ep->num = ep_addr & EP_ADDR_MSK;
	//ep->maxpacket = ep_mps;
	//ep->type = ep_type;

	if(epStt.In != 0)
	{
		//set txfifo
		//ep->tx_fifo_num = ep->num;
	}
	
	// init data PID
	if(epType == 2) //bulk type
	{
		//ep->data_pid_start = 0U;
	}

	//epNum = epAddress & 0x0f;
	usbdActivateEndpoint((epAddress & 0x0f), epType, epMaxPacketSize);

