githup98/stm32ProgramBasedRegister/usbStm32f411vet6Register/Core/Src/newUsb.c
}


void usbdOpenEp(uint8_t epAddress, uint8_t epType, uint8_t epMaxPacketSize)
{
	openEp(epAddress, epType, epMaxPacketSize);
}

void enumReset(void)
{
	//#ifdef USE_USBD_COMPOSITE
	//#endif

	//for OUT EP
	usbdOpenEp(0x00, 2, 64); //2: bulk type
	
	//pdev->ep_out[0x00U & 0xFU].is_used = 1U;
	//pdev->ep_out[0].maxpacket = USB_MAX_EP0_SIZE;
	
	//for IN EP
	usbdOpenEp(0x80, 2, 64);
	
	//pdev->ep_out[0x00U & 0xFU].is_used = 1U;
	//pdev->ep_out[0].maxpacket = USB_MAX_EP0_SIZE;
}


void enumdoneResetCallback(void)
{
	//set speed, this func is used in qualify config
	//enumSetSpeed(); // program based on register isn't consider temply
	
	//reset
	enumReset();
}

#define LIMIT 20
#define LIMIT_1 21
uint8_t checkOderRun[20] = {0};
//uint8_t indexCheckOderRun = 0;
uint8_t startStoreOder = 0;
void usbInterruptHandler(void)
{

// handler for usb suspend, reset enumdone, read, get descriptor, transfer data into FIFO, IN done, OUT done


	uint32_t regVal = ((*pOTG_FS_GINTSTS) & (*pOTG_FS_GINTMSK));


	//check mismatch interrupt
	if(((regVal >> MMIS) & 1) == 1)
	{
		//clear mismode interrupt bit
		*pOTG_FS_GINTSTS |= (1 << MMIS);
		return;
	}


	//receive data from host
	if(((regVal >> RXFLVL) & 1) == 1)
	{



		//read GRXSTP check kind of received data is data package or setup package
		*pOTG_FS_GINTMSK &= ~(1 << RXFLVLM);
		if(((*pOTG_FS_GRXSTSP >> PKTSTS) & 7) == SETUP_PKG_RECEIVED) //if use *pOTG_FS_GRXSTSR in here,
																	 //data will be one byte right shifted
																	 //not in 0x00 address anymore
		{


			USB_ReadPacket();
			
			if((usbReceivedData[0] ==  0x01000680) )
			{
			//	checkProblemEMPMSK = 1;
				startStoreOder = 1;
			}

			if(startStoreOder > 0)
			{
				checkOderRun[indexCheckOderRun] = 1;
				indexCheckOderRun ++;
				if(indexCheckOderRun >= LIMIT)
				{
					indexCheckOderRun = LIMIT_1;
				}
			}

		}

		//clear receive data interrupt bit

		*pOTG_FS_GINTMSK |= (1 << RXFLVLM);
	}


////	*pOTG_FS_GINTMSK |= ((1 << USBSUSPM) | (1 << USBRST) | (1 << ENUMDNEM) \
	| (1 << OEPINT) | (1 << IEPINT) | (1 << IISOIXFRM) | (1 << IPXFRM_DEVICE_MOD) \
	| (1 << WUIM));



	if(((regVal >> OEPINT) & 1) == 1)
	{
		uint32_t epIntr = *pOTG_FS_DAINT;
		while((epIntr & 0x10000))
		{
			if((*pOTG_FS_DOEPINTx >> XFRC) & 0x01)
			{
				if(startStoreOder > 0)
							{
								checkOderRun[indexCheckOderRun] = 2;
								indexCheckOderRun ++;
								if(indexCheckOderRun >= LIMIT)
								{
									indexCheckOderRun = LIMIT_1;
								}
							}
				(*pOTG_FS_DOEPINTx |= (1 << XFRC));
				epOutComplete(0);
			}
			if((*pOTG_FS_DOEPINTx >> EPDISD) & 0x01)
			{
				if(startStoreOder > 0)
							{
								checkOderRun[indexCheckOderRun] = 3;
								indexCheckOderRun ++;
								if(indexCheckOderRun >= LIMIT)
								{
									indexCheckOderRun = LIMIT_1;
								}
							}
				(*pOTG_FS_DOEPINTx |= (1 << EPDISD));
			}
			if((*pOTG_FS_DOEPINTx >> STUP) & 0x01)
			{

				if(startStoreOder > 0)
							{
								checkOderRun[indexCheckOderRun] = 4;
								indexCheckOderRun ++;
								if(indexCheckOderRun >= LIMIT)
								{
									indexCheckOderRun = LIMIT_1;
								}
							}
				
				//clear STUP interrupt bit
				(*pOTG_FS_DOEPINTx |= (1 << STUP));

				//extract the received packet
				extractSetupPacket(usbReceivedData);
			}
			if((*pOTG_FS_DOEPINTx >> STSPHSRX) & 0x01)
			{
				if(startStoreOder > 0)
							{
								checkOderRun[indexCheckOderRun] = 5;
								indexCheckOderRun ++;
								if(indexCheckOderRun >= LIMIT)
								{
									indexCheckOderRun = LIMIT_1;
								}
							}
				(*pOTG_FS_DOEPINTx |= (1 << STSPHSRX));
			}
			if((*pOTG_FS_DOEPINTx >> NAK) & 0x01)
			{
				if(startStoreOder > 0)
							{
								checkOderRun[indexCheckOderRun] = 6;
								indexCheckOderRun ++;
								if(indexCheckOderRun >= LIMIT)
								{
									indexCheckOderRun = LIMIT_1;
								}
							}
				(*pOTG_FS_DOEPINTx |= (1 << NAK));
			}

			epIntr >>= 1;
		}

	}
	
	if(((regVal >> IEPINT) & 0x01) == 1)
	{
		uint32_t epIntr = *pOTG_FS_DAINT;
		while((epIntr & 0x1))
		{	
			if((*pOTG_FS_DIEPINTx >> XFRC) & 0x01)
			{
				if(startStoreOder > 0)
							{
								checkOderRun[indexCheckOderRun] = 7;
								indexCheckOderRun ++;
								if(indexCheckOderRun >= LIMIT)
								{
									indexCheckOderRun = LIMIT_1;
								}
							}
				//clear XFRC flag
				(*pOTG_FS_DIEPINTx |= (1 << XFRC));
				dataInStageCallback(usbReceivedData);
				//*pOTG_FS_DIEPEMPMSK &= ~(1 << 0); //this line for case: INEPTXFEM bit is enable when TXFE disable this bit but,
												  //this func enable it again
			}
			if((*pOTG_FS_DIEPINTx >> TOC) & 0x01)
			{
				if(startStoreOder > 0)
							{
								checkOderRun[indexCheckOderRun] = 8;
								indexCheckOderRun ++;
								if(indexCheckOderRun >= LIMIT)
								{
									indexCheckOderRun = LIMIT_1;
								}
							}
				(*pOTG_FS_DIEPINTx |= (1 << TOC));
			}
			if((*pOTG_FS_DIEPINTx >> EPDISD) & 0x01)
			{
				if(startStoreOder > 0)
							{
								checkOderRun[indexCheckOderRun] = 9;
								indexCheckOderRun ++;
								if(indexCheckOderRun >= LIMIT)
								{
									indexCheckOderRun = LIMIT_1;
								}
							}
				(*pOTG_FS_DIEPINTx |= (1 << EPDISD));
			}
		
			if((*pOTG_FS_DIEPINTx >> TXFE) & 0x01)
			{
				if((*pOTG_FS_DIEPEMPMSK & 0x01) == 1)
				{
					if(startStoreOder > 0)
								{
									checkOderRun[indexCheckOderRun] = 10;
									indexCheckOderRun ++;
									if(indexCheckOderRun >= LIMIT)
									{
										indexCheckOderRun = LIMIT_1;
									}
								}

					//write to fifo
					writeEmpFifo((uint8_t*)Descriptor, remainLengthEp0);
				}
			}

			epIntr >>= 1;
		}

	}

	if(((regVal >> USBSUSP) & 1) == 1)
	{
		//set status suspend (when program based register, we dont care?), stop USB PHY clock source (gate clock register)

		if(startStoreOder > 0)
					{
						checkOderRun[indexCheckOderRun] = 11;
						indexCheckOderRun ++;
						if(indexCheckOderRun >= LIMIT)
						{
							indexCheckOderRun = LIMIT_1;
						}
					}

		suspendCallback();

