githup98/stm32ProgramBasedRegister/usbStm32f411vet6Register/Core/Src/newUsb.c
	}


#if 0
	if(((regVal >> IISOIXFR) & 1) == 1)
	{
		if(indexCheckOderRun < 20)
		{
			checkOderRun[indexCheckOderRun] = 12;
			indexCheckOderRun ++;
		}
		*pOTG_FS_GINTSTS |= (1 << IISOIXFR);
	}
	if(((regVal >> IPXFR_DEVICE_MOD) & 1) == 1)
	{
		if(indexCheckOderRun < 20)
		{
			checkOderRun[indexCheckOderRun] = 13;
			indexCheckOderRun ++;
		}
		*pOTG_FS_GINTSTS |= (1 << IPXFR_DEVICE_MOD);
	}
#endif //if0
	
	if(((regVal >> WUI) & 1) == 1)
	{
		if(startStoreOder > 0)
					{
						checkOderRun[indexCheckOderRun] = 12;
						indexCheckOderRun ++;
						if(indexCheckOderRun >= LIMIT)
						{
							indexCheckOderRun = LIMIT_1;
						}
					}
		*pOTG_FS_GINTSTS |= (1 << WUI);
	}


	if(((regVal >> USBRST) & 1) == 1)
	{
		//call reset USB function

		if(startStoreOder > 0)
					{
						checkOderRun[indexCheckOderRun] = 13;
						indexCheckOderRun ++;
						if(indexCheckOderRun >= LIMIT)
						{
							indexCheckOderRun = LIMIT_1;
						}
					}
		resetUSBSignal();

		//clear USB reset interrupt bit (write 1 to clear this bit)
		*pOTG_FS_GINTSTS |= (1 << USBRST);

	}
	//due to scenario : suspend -> reset -> enumdne ...
	if(((regVal >> ENUMDNE) & 1) == 1)
	{
		
		if(startStoreOder > 0)
					{
						checkOderRun[indexCheckOderRun] = 14;
						indexCheckOderRun ++;
						if(indexCheckOderRun >= LIMIT)
						{
							indexCheckOderRun = LIMIT_1;
						}
					}
		usbActiveSetup();
		uint8_t speed = usbGetSpeed();
		//uint8_t sysclk;
		//hclk (differ with sysclk) = 48MHZ, check  SystemCoreClock from SystemClock_config in main or get by HAL_RCC_GetHCLKFreq()
		usbSetTRDTValue(HAL_RCC_GetHCLKFreq(),speed);
		
		//reset when enumdone
		enumdoneResetCallback();

		*pOTG_FS_GINTSTS |= (1 << ENUMDNE);
		//get speed from DSTS register

		//PCD_ reset: set speed for dev_speed in pdev struct, enable interrupt for end point, set param and enable the usb end point
	}

}




void initUsb(void)
{
	pinConfig();
	
	HAL_NVIC_SetPriority(OTG_FS_IRQn, 0, 0);
    HAL_NVIC_EnableIRQ(OTG_FS_IRQn);

	//disable global interrupt
	*pOTG_FS_GAHBCFG &= ~(1 << GINTMSK_);

	*pOTG_FS_GUSBCFG |= (1 << PHYSEL); //select transceiver
	if(resetCore() != SOFT_RESET_OK)
	{
//		while(1)
//		{
//			GPIOD->ODR |= (1 << 14);
//			GPIOD->ODR |= (1 << 12);
//			HAL_Delay(500);
//			GPIOD->ODR &= ~(1 << 14);
//			GPIOD->ODR &= ~(1 << 12);
//			HAL_Delay(500);
//		}
	} //reset after select transceiver

	*pOTG_FS_GCCFG |= (1 << PWRDWN); //disable power down force to usb host recognize this device
	
	setMode(FDMOD);
	
	if(devInit() != 0)
	{
//		while(1)
//		{
//			//GPIOD->ODR |= (1 << 13);
//			GPIOD->ODR |= (1 << 12);
//			HAL_Delay(500);
//			//GPIOD->ODR &= ~(1 << 13);
//			GPIOD->ODR &= ~(1 << 12);
//			HAL_Delay(500);
//		}
	}
	setRxSizeFifo(0x80);
	setTxSizeFifo(0, 0x40);
	setTxSizeFifo(1, 0x80);
	
	//start connecting
	startDev();
	//coreUsbInit();

	//deviceUsbInit();

	// next step will be handle of in IRQ routine
	//to be continued
}
